eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
/*----------------------------------------------------------------------------*/
/*
 * Copyright (C) Bosch Connected Devices and Solutions GmbH. 
 * All Rights Reserved. Confidential.
 *
 * Distribution only to people who need to know this information in
 * order to do their job.(Need-to-know principle).
 * Distribution to persons outside the company, only if these persons
 * signed a non-disclosure agreement.
 * Electronic transmission, e.g. via electronic mail, must be made in
 * encrypted form.
 */
/*----------------------------------------------------------------------------*/

/* include gtest interface */
#include <gtest.h>

/* start of global scope symbol and fake definitions section */
FFF_DEFINITION_BLOCK_START

extern "C"
{

/* Silence Module ID not-defined configuration */
#define BCDS_MODULE_ID 0

/* Overwrite HAL Configuration */
#define BCDS_FEATURE_TIMER  1

#define RTC_PRESENT
#define RTC_COUNT 1

#define TIMER_PRESENT
#define TIMER_COUNT 0

#define LETIMER_PRESENT
#define LETIMER_COUNT 0

#include "BCDS_Basics.h"
#include "BCDS_Retcode_th.hh"
#include "BCDS_Assert_th.hh"

#include "BCDS_HAL_th.hh"

#include "em_device_th.hh"
#include "em_cmu_th.hh"
#include "em_rtc_th.hh"
#include "em_burtc_th.hh"
#include "em_timer_th.hh"
#include "em_letimer_th.hh"


#ifndef _RTC_CNT_CNT_MASK
#define _RTC_CNT_CNT_MASK 0xFFFFFFUL
#endif

#ifndef _RTC_CNT_CNT_SHIFT
#define _RTC_CNT_CNT_SHIFT 0
#endif

BURTC_TypeDef BURTC_HW;
BURTC_TypeDef * BURTC = &BURTC_HW;

/**
 * Module under test
 */
#include "Timer.c"

FAKE_VOID_FUNC(TimerTestCallback, Timer_T, struct MCU_Timer_Event_S);

/* ************************************************************************** */
/* * BURTC DRIVER *********************************************************** */
/* ************************************************************************** */

/* Initialize and Deinitialize Structs */
const BURTC_Init_TypeDef BurtcInitStruct = BURTC_INIT_DEFAULT;
const BURTC_Init_TypeDef BurtcDeInitStruct = BURTC_INIT_DEFAULT;

/* Default Generic Initializer */
const uint32_t GenericInitStruct = UINT32_C(0);
const uint32_t GenericDeInitStruct = UINT32_C(0);



uint32_t GenericHW = UINT32_C(0);

/* BURTC Driver Struct */
struct MCU_Timer_Handle_S BSP_BURTC_Handle = {
        &BURTC_HW, /* BURTC HW Handle */
        EM_BURTC, /* Timer Type */
        &BurtcInitStruct, /* Initialize Struct */
        &BurtcDeInitStruct, /* Deinitialize Struct */
        MCU_TIMER_STATUS_INVALID, /* Init Timer */
        NULL /* Default Callback */
};

/* Generic Driver Struct */
struct MCU_Timer_Handle_S BSP_Generic_Handle = {
        &GenericHW, /* BURTC HW Handle */
        EM_RTC, /* Timer Type */
        &GenericInitStruct, /* Initialize Struct */
        &GenericDeInitStruct, /* Deinitialize Struct */
        MCU_TIMER_STATUS_INVALID, /* Init Timer */
        NULL /* Default Callback */
};

struct MCU_Timer_Handle_S * BSP_BURTC_HandleCopy;
struct MCU_Timer_Handle_S * BSP_Generic_HandleCopy;


}

/* end of global scope symbol and fake definitions section */
FFF_DEFINITION_BLOCK_END

class HAL_MCU_Timer_Test: public testing::Test
{
protected:

virtual void SetUp()
{
    FFF_RESET_HISTORY()

    /* BURTC Fakes */
    RESET_FAKE (BURTC_CompareGet);
    RESET_FAKE (BURTC_CompareSet);
    RESET_FAKE (BURTC_CounterGet);
    RESET_FAKE (BURTC_Enable);
    RESET_FAKE (BURTC_Init);
    RESET_FAKE (BURTC_IntGet);

    RESET_FAKE (RTC_CompareGet);
    RESET_FAKE (RTC_CompareSet);
    RESET_FAKE (RTC_CounterGet);
    RESET_FAKE (RTC_Enable);
    RESET_FAKE (RTC_Init);
    RESET_FAKE (RTC_IntGet);

    RESET_FAKE (TIMER_CaptureGet);
    RESET_FAKE (TIMER_CompareSet);
    RESET_FAKE (TIMER_CounterGet);
    RESET_FAKE (TIMER_Enable);
    RESET_FAKE (TIMER_Init);
    RESET_FAKE (TIMER_IntGet);

    RESET_FAKE (LETIMER_CompareGet);
    RESET_FAKE (LETIMER_CompareSet);
    RESET_FAKE (LETIMER_CounterGet);
    RESET_FAKE (LETIMER_Enable);
    RESET_FAKE (LETIMER_Init);
    RESET_FAKE (LETIMER_IntGet);

    /* Callback Fakes */
    RESET_FAKE (TimerTestCallback);
    RESET_FAKE(Retcode_RaiseError);

    /* Copy the default handle into memory */
    BSP_BURTC_HandleCopy = (struct MCU_Timer_Handle_S *) malloc(sizeof(struct MCU_Timer_Handle_S));
    BSP_Generic_HandleCopy = (struct MCU_Timer_Handle_S *) malloc(sizeof(struct MCU_Timer_Handle_S));


    memcpy((void*) BSP_BURTC_HandleCopy,   (void *) &BSP_BURTC_Handle, sizeof(BSP_BURTC_Handle));
    memcpy((void*) BSP_Generic_HandleCopy, (void *) &BSP_Generic_Handle, sizeof(BSP_Generic_Handle));

}

virtual void TearDown()
{
    /* Restore the default handles */

    memcpy((void *) &BSP_BURTC_Handle,   (void*) BSP_BURTC_HandleCopy, sizeof(BSP_BURTC_Handle));
    memcpy((void*) &BSP_Generic_Handle, (void *) BSP_Generic_HandleCopy, sizeof(BSP_Generic_Handle));

    free((void *) BSP_BURTC_HandleCopy);
    free((void *) BSP_Generic_HandleCopy);
}
};

#define TIMER_TEST_INITIALIZE 1
#define TIMER_TEST_DEINITIALIZE 1
#define TIMER_TEST_SET_COMPARE 1
#define TIMER_TEST_GET_COMPARE 1
#define TIMER_TEST_GET_COUNT 1
#define TIMER_TEST_GET_MAXCOUNT 1
#define TIMER_TEST_START 1
#define TIMER_TEST_STOP 1

TEST_F(HAL_MCU_Timer_Test, RetcodeAndModuleIdIntegrity)
{
    ASSERT_EQ(BCDS_ESSENTIALS_MODULE_ID_TIMER, BCDS_MODULE_ID );
}



/* ************************************************************************** */
/* * TIMER INITIALIZE TESTS ************************************************* */
/* ************************************************************************** */
#if (TIMER_TEST_INITIALIZE)
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_NULL)
{
    Timer_T timer = NULL;

    Retcode_T rc;

    rc =  MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}

/* This Test corrupts the HW Handle */
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_HW_NULL)
{
    Timer_T timer = (Timer_T)&BSP_BURTC_Handle;
    void * hwHandle = (void *)&(BSP_BURTC_Handle.HwHandle);

    /* Corrupt HW Handle */
    memset(hwHandle, 0, sizeof(BSP_BURTC_Handle.HwHandle));

    Retcode_T rc;

