eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    rc =  MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);
}

/* This Test corrupts the InitStruct Handle */
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_Init_NULL)
{
    Timer_T timer = (Timer_T)&BSP_BURTC_Handle;

    void * hwHandle = (void *)&(BSP_BURTC_Handle.InitHandle);

    /* Corrupt HW Handle */
    memset(hwHandle, 0, sizeof(BSP_BURTC_Handle.InitHandle));

    Retcode_T rc;

    rc =  MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ( RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOINIT), rc);
}

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_BURTC)
{
    Timer_T timer = (Timer_T)&BSP_BURTC_Handle;

    Retcode_T rc;

    ASSERT_EQ(NULL, BSP_BURTC_Handle.Callback);

    rc = MCU_Timer_Initialize(timer, TimerTestCallback);
    ASSERT_EQ(RETCODE_OK, rc);

    /* Assert that BURTC Init was called */
    ASSERT_EQ(1, BURTC_Init_fake.call_count);

    /* Assert that the Timer Test Callback was registered */
    ASSERT_EQ(&TimerTestCallback, BSP_BURTC_Handle.Callback);
}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_RTC)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt HW Handle */
    *type = EM_RTC;

    Retcode_T rc;

    rc = MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE_OK, rc);

    /* Assert that BURTC Init was called */
    ASSERT_EQ(1, RTC_Init_fake.call_count);

    /* Assert that the Timer Test Callback was registered */
    ASSERT_EQ(&TimerTestCallback, BSP_Generic_Handle.Callback);
}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_TIMER)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt HW Handle */
    *type = EM_TIMER;

    Retcode_T rc;

    rc = MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);
/*    ASSERT_EQ(RETCODE_OK, rc); */

    /* Assert that BURTC Init was called */
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
/*    ASSERT_EQ(1, TIMER_Init_fake.call_count); */

    /* Assert that the Timer Test Callback was not registered */
    ASSERT_EQ(NULL, BSP_Generic_Handle.Callback);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerInitialize_LETIMER)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt HW Handle */
    *type = EM_LETIMER;

    Retcode_T rc;

    rc = MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);
/*    ASSERT_EQ(RETCODE_OK, rc); */

    /* Assert that BURTC Init was called */
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
/*    ASSERT_EQ(1, TIMER_Init_fake.call_count); */

    /* Assert that the Timer Test Callback was not registered */
    ASSERT_EQ(NULL, BSP_Generic_Handle.Callback);
}
#endif /* BCDS_FEATURE_EFM32_LETIMER */

TEST_F(HAL_MCU_Timer_Test, TimerInitialize_INVALID_PARAM)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(5);

    Retcode_T rc;

    rc = MCU_Timer_Initialize(timer, TimerTestCallback);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    /* Assert that BURTC Init was called */
    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);

    /* Assert that the Timer Test Callback was not registered */
    ASSERT_EQ(NULL, BSP_Generic_Handle.Callback);
}
#endif


/* ************************************************************************** */
/* * TIMER DEINITIALIZE TESTS *********************************************** */
/* ************************************************************************** */
#if TIMER_TEST_DEINITIALIZE
TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_NULL)
{
    Timer_T timer = NULL;

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}


TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_NULL_HW)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt HW Handle */
    void * hwHandle = (void *)&(BSP_Generic_Handle.HwHandle);
    memset(hwHandle, 0, sizeof(BSP_Generic_Handle.HwHandle));

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}

TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_NoDeinitHandle)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    void * initHandle = (void *)&(BSP_Generic_Handle.DeInitHandle);
    memset(initHandle, 0, sizeof(BSP_Generic_Handle.DeInitHandle));

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_RTC)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

