eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(EM_RTC);

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(1, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_BURTC)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(EM_BURTC);

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(1, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_TIMER)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(EM_TIMER);

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_LETIMER)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(EM_LETIMER);

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */

TEST_F(HAL_MCU_Timer_Test, TimerDeInitialize_INVALID_PARAM)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt DeInit Handle */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);

    /* Corrupt type */
    *type = (enum Hal_MCU_Timer_E)(10);

    Retcode_T rc;

    rc =  MCU_Timer_Deinitialize(timer);

    /* HW HANDLE INVALID */
    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Init_fake.call_count);
    ASSERT_EQ(0, BURTC_Init_fake.call_count);
    ASSERT_EQ(0, LETIMER_Init_fake.call_count);
    ASSERT_EQ(0, TIMER_Init_fake.call_count);
}
#endif

/* ************************************************************************** */
/* * TIMER SET COMPARE TESTS ************************************************ */
/* ************************************************************************** */
#if TIMER_TEST_SET_COMPARE

TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_NULLPOINTER)
{

    Retcode_T rc;

    Timer_T timer = (uint32_t)NULL;

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}


TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_HWPOINTER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt HW Handle */
    uint32_t * hwHandle =  (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);
}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_RTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(1, RTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareSet_fake.call_count);
    ASSERT_EQ(0, TIMER_CompareSet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_BURTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_CompareSet_fake.call_count);
    ASSERT_EQ(1, BURTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareSet_fake.call_count);
    ASSERT_EQ(0, TIMER_CompareSet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_TIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareSet_fake.call_count);
    ASSERT_EQ(0, TIMER_CompareSet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_LETIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

