eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareSet_fake.call_count);
    ASSERT_EQ(0, TIMER_CompareSet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */

TEST_F(HAL_MCU_Timer_Test, TimerSetCompare_INVALID_TYPE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_SetCompareValue(timer, 0, 1);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareSet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareSet_fake.call_count);
    ASSERT_EQ(0, TIMER_CompareSet_fake.call_count);

}
#endif

/* ************************************************************************** */
/* * TIMER GET COMPARE TESTS ************************************************ */
/* ************************************************************************** */
#if TIMER_TEST_GET_COMPARE

TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_NULLPOINTER)
{

    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)NULL;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}


TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_HWPOINTER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt HW Handle */
    uint32_t * hwHandle =  (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);
}

TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_NULL_VALUE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;
    rc = MCU_Timer_GetCompareValue(timer, 0, NULL);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);

    ASSERT_EQ(0, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_RTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(1, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_BURTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(1, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_TIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_LETIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */


TEST_F(HAL_MCU_Timer_Test, TimerGetCompare_INVALID_TYPE)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_GetCompareValue(timer, 0, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CompareGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CompareGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CaptureGet_fake.call_count);

}
#endif

/* ************************************************************************** */
/* * TIMER GET COUNT TESTS ************************************************** */
/* ************************************************************************** */
#if TIMER_TEST_GET_COUNT
TEST_F(HAL_MCU_Timer_Test, TimerGetCount_NULLPOINTER)
{

    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (uint32_t)NULL;

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}


TEST_F(HAL_MCU_Timer_Test, TimerGetCount_HWPOINTER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt HW Handle */
    uint32_t * hwHandle =  (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    rc = MCU_Timer_GetCountValue(timer, &value);

