eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);
}

TEST_F(HAL_MCU_Timer_Test, TimerGetCount_NULL_VALUE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    rc = MCU_Timer_GetCountValue(timer, NULL);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);


    ASSERT_EQ(0, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetCount_RTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE_OK, rc);


    ASSERT_EQ(1, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetCount_BURTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE_OK, rc);


    ASSERT_EQ(0, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(1, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetCount_TIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);


    ASSERT_EQ(0, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetCount_LETIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);


    ASSERT_EQ(0, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */


TEST_F(HAL_MCU_Timer_Test, TimerGetCount_INVALID_TYPE)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_GetCountValue(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, BURTC_CounterGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_CounterGet_fake.call_count);
    ASSERT_EQ(0, TIMER_CounterGet_fake.call_count);

}
#endif

/* ************************************************************************** */
/* * TIMER GET MAXCOUNT TESTS *********************************************** */
/* ************************************************************************** */
#if TIMER_TEST_GET_MAXCOUNT
TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_NULLPOINTER)
{

    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)NULL;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}


TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_HWPOINTER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt HW Handle */
    uint32_t * hwHandle =  (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);
}

TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_NULL_VALUE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    rc = MCU_Timer_GetMaxCount(timer, NULL);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);
}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_RTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(_RTC_CNT_CNT_MASK, value);

    ASSERT_EQ(RETCODE_OK, rc);


}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_BURTC)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE_OK, rc);
    ASSERT_EQ(_BURTC_CNT_CNT_MASK, value);


}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_TIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

