eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_LETIMER)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);
}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */


TEST_F(HAL_MCU_Timer_Test, TimerGetMaxCount_INVALID_TYPE)
{
    Retcode_T rc;
    uint32_t value;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_GetMaxCount(timer, &value);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);



}
#endif


/* ************************************************************************** */
/* * TIMER START TESTS ****************************************************** */
/* ************************************************************************** */
#if TIMER_TEST_START
TEST_F(HAL_MCU_Timer_Test, TimerStart_NULL_POINTER)
{
    Retcode_T rc;


    Timer_T timer = 0;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);

}


TEST_F(HAL_MCU_Timer_Test, TimerStart_NOHWHANDLE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    uint32_t * hwHandle = (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);

}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerStart_RTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(1, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerStart_BURTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(1, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerStart_LETIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerStart_TIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

TEST_F(HAL_MCU_Timer_Test, TimerStart_INVALID)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_Start(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}

#endif


/* ************************************************************************** */
/* * TIMER STOP TESTS ******************************************************* */
/* ************************************************************************** */
#if TIMER_TEST_STOP
TEST_F(HAL_MCU_Timer_Test, TimerStop_NULL_POINTER)
{
    Retcode_T rc;

    Timer_T timer = 0;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER), rc);

}


TEST_F(HAL_MCU_Timer_Test, TimerStop_NOHWHANDLE)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    uint32_t * hwHandle = (uint32_t *)&(BSP_Generic_Handle.HwHandle);
    *hwHandle = (uint32_t )NULL;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_TIMER_NOHWHANDLE), rc);

}

#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerStop_RTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_RTC;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE_OK, rc);

