eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    ASSERT_EQ(1, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerStop_BURTC)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_BURTC;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE_OK, rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(1, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, TimerStop_LETIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_LETIMER;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, TimerStop_TIMER)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )EM_TIMER;

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */

TEST_F(HAL_MCU_Timer_Test, TimerStop_INVALID)
{
    Retcode_T rc;

    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    /* Corrupt Type Information */
    uint32_t * type =  (uint32_t *)&(BSP_Generic_Handle.HwType);
    *type = (uint32_t )(10);

    rc = MCU_Timer_Stop(timer);

    ASSERT_EQ(RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM), rc);

    ASSERT_EQ(0, RTC_Enable_fake.call_count);
    ASSERT_EQ(0, BURTC_Enable_fake.call_count);
    ASSERT_EQ(0, LETIMER_Enable_fake.call_count);
    ASSERT_EQ(0, TIMER_Enable_fake.call_count);
}

#endif


/* ************************************************************************** */
/* * TIMER EXTRACT FLAGS RTC ************************************************ */
/* ************************************************************************** */
#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, TimerExtractFlagsRTC)
{
    struct MCU_Timer_Event_S event;
    uint32_t flags;

    ASSERT_EQ(2, RTC_IF_COMP0);
    ASSERT_EQ(4, RTC_IF_COMP1);
    ASSERT_EQ(2+4, RTC_IF_COMP0 | RTC_IF_COMP1);

    flags = 0;

    event =  extractFlags_RTC(flags);

    ASSERT_EQ(0, event.CompareMatch);
    ASSERT_EQ(0, event.CompareChannel);

    /* Compare match Channel 0*/
    flags = RTC_IF_COMP0;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(1, event.CompareMatch);
    ASSERT_EQ(MCU_TIMER_COMPARE_CHANNEL0, event.CompareChannel);

    /* Compare match Channel 1*/
    flags = RTC_IF_COMP1;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(1, event.CompareMatch);
    ASSERT_EQ(MCU_TIMER_COMPARE_CHANNEL1, event.CompareChannel);


    /* Compare match Channel 1 and 2*/
    flags = RTC_IF_COMP0 | RTC_IF_COMP1;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(1, event.CompareMatch);
    ASSERT_EQ(MCU_TIMER_COMPARE_CHANNEL0 | MCU_TIMER_COMPARE_CHANNEL1, event.CompareChannel);


    /* Test for Overflow */
    /* Compare match Channel 1 and 2*/
    flags = RTC_IF_OF;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(0, event.CompareMatch);
    ASSERT_EQ(1, event.Overflow);

}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */


/* ************************************************************************** */
/* * TIMER EXTRACT FLAGS BURTC ********************************************** */
/* ************************************************************************** */
#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, TimerExtractFlagsBURTC)
{
    struct MCU_Timer_Event_S event;
    uint32_t flags;

    ASSERT_EQ(2, BURTC_IF_COMP0);

    flags = 0;

    event =  extractFlags_BURTC(flags);

    ASSERT_EQ(0, event.CompareMatch);
    ASSERT_EQ(0, event.CompareChannel);

    /* Compare match Channel 0*/
    flags = BURTC_IF_COMP0;
    event =  extractFlags_BURTC(flags);

    ASSERT_EQ(true, event.CompareMatch);
    ASSERT_EQ(MCU_TIMER_COMPARE_CHANNEL0, event.CompareChannel);

    /* LFXCO Fail */
    flags = BURTC_IF_LFXOFAIL;
    event =  extractFlags_BURTC(flags);

    ASSERT_EQ(0, event.CompareMatch);
    ASSERT_EQ(TIMER_LFXCO_FAILURE, event.ErrorCode);


    /* Compare match Channel 1 and 2*/
    flags = RTC_IF_COMP0 | RTC_IF_COMP1;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(1, event.CompareMatch);
    ASSERT_EQ(MCU_TIMER_COMPARE_CHANNEL0 | MCU_TIMER_COMPARE_CHANNEL1, event.CompareChannel);


    /* Test for Overflow */
    /* Compare match Channel 1 and 2*/
    flags = RTC_IF_OF;
    event =  extractFlags_RTC(flags);

    ASSERT_EQ(0, event.CompareMatch);
    ASSERT_EQ(1, event.Overflow);

}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */


/* ************************************************************************** */
/* * GET TIMER EVENTS ******************************************************* */
/* ************************************************************************** */
#if (BCDS_FEATURE_EFM32_RTC)
TEST_F(HAL_MCU_Timer_Test, getTimerEvent_RTC)
{
    struct MCU_Timer_Event_S event;

  //  uint32_t timer = &BSP_Generic_Handle;

    /* Corrupt Type Information */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);
    *type = EM_RTC;

