eclipse-archived/kiso/core/essentials/test/unit/source/efm32/Timer_unittest.cc
    event = getTimerEvent(&BSP_Generic_Handle);

    ASSERT_EQ(1, RTC_IntGet_fake.call_count);
    ASSERT_EQ(0, BURTC_IntGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_IntGet_fake.call_count);
    ASSERT_EQ(0, TIMER_IntGet_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_RTC) */

#if (BCDS_FEATURE_EFM32_BURTC)
TEST_F(HAL_MCU_Timer_Test, getTimerEvent_BURTC)
{
    struct MCU_Timer_Event_S event;

  //  uint32_t timer = &BSP_Generic_Handle;

    /* Corrupt Type Information */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);
    *type = EM_BURTC;

    event = getTimerEvent(&BSP_Generic_Handle);

    ASSERT_EQ(0, RTC_IntGet_fake.call_count);
    ASSERT_EQ(1, BURTC_IntGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_IntGet_fake.call_count);
    ASSERT_EQ(0, TIMER_IntGet_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_BURTC) */

#if (BCDS_FEATURE_EFM32_LETIMER)
TEST_F(HAL_MCU_Timer_Test, getTimerEvent_LETIMER)
{
    struct MCU_Timer_Event_S event;

  //  uint32_t timer = &BSP_Generic_Handle;

    /* Corrupt Type Information */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);
    *type = EM_LETIMER;

    event = getTimerEvent(&BSP_Generic_Handle);

    ASSERT_EQ(0, RTC_IntGet_fake.call_count);
    ASSERT_EQ(0, BURTC_IntGet_fake.call_count);
  //  ASSERT_EQ(1, LETIMER_IntGet_fake.call_count);
    ASSERT_EQ(0, TIMER_IntGet_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_LETIMER) */

#if (BCDS_FEATURE_EFM32_TIMER)
TEST_F(HAL_MCU_Timer_Test, getTimerEvent_TIMER)
{
    struct MCU_Timer_Event_S event;

  //  uint32_t timer = &BSP_Generic_Handle;

    /* Corrupt Type Information */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);
    *type = EM_TIMER;

    event = getTimerEvent(&BSP_Generic_Handle);

    ASSERT_EQ(0, RTC_IntGet_fake.call_count);
    ASSERT_EQ(0, BURTC_IntGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_IntGet_fake.call_count);
  //  ASSERT_EQ(1, TIMER_IntGet_fake.call_count);
}
#endif /* if (BCDS_FEATURE_EFM32_TIMER) */


TEST_F(HAL_MCU_Timer_Test, getTimerEvent_FAIL)
{
    struct MCU_Timer_Event_S event;

  //  uint32_t timer = &BSP_Generic_Handle;

    /* Corrupt Type Information */
    enum Hal_MCU_Timer_E * type = (enum Hal_MCU_Timer_E *)&(BSP_Generic_Handle.HwType);
    *type = (enum Hal_MCU_Timer_E)10;

    event = getTimerEvent(&BSP_Generic_Handle);

    ASSERT_EQ(0, RTC_IntGet_fake.call_count);
    ASSERT_EQ(0, BURTC_IntGet_fake.call_count);
    ASSERT_EQ(0, LETIMER_IntGet_fake.call_count);
    ASSERT_EQ(0, TIMER_IntGet_fake.call_count);
}

/* ************************************************************************** */
/* * TIMER CALLBACK EXECUTE ************************************************* */
/* ************************************************************************** */
TEST_F(HAL_MCU_Timer_Test,  MCU_Timer_Callback_NULLTIMER)
{
    Timer_T timer = UINT32_C(0);

    MCU_Timer_Callback(timer);

    ASSERT_EQ(1, Retcode_RaiseError_fake.call_count);
    ASSERT_EQ(0, TimerTestCallback_fake.call_count);


}

TEST_F(HAL_MCU_Timer_Test,  MCU_Timer_Callback_NULLCALLBACK)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    MCU_TIMER_Callback_T * callback = &(BSP_Generic_Handle.Callback);

    *callback = (MCU_TIMER_Callback_T)NULL;

    MCU_Timer_Callback(timer);

    ASSERT_EQ(0, Retcode_RaiseError_fake.call_count);
    ASSERT_EQ(0, TimerTestCallback_fake.call_count);
}

TEST_F(HAL_MCU_Timer_Test,  MCU_Timer_Callback)
{
    Timer_T timer = (Timer_T)&BSP_Generic_Handle;

    MCU_TIMER_Callback_T * callback = &(BSP_Generic_Handle.Callback);

    *callback = (MCU_TIMER_Callback_T)TimerTestCallback;

    MCU_Timer_Callback(timer);

    ASSERT_EQ(0, Retcode_RaiseError_fake.call_count);
    ASSERT_EQ(1, TimerTestCallback_fake.call_count);
}
//TimerTestCallback
